Repository: AnasJayyusi/MaidLinker
Catalog: MaidLinker/Resources/Views.Home.Index.*.resx
Languages: ar_sa

# ChooseMaid
source: Browse Maids Now
ar_sa: تصفح العاملات الآن

# CityDefaultSelection
source: Choose City
ar_sa: اختر المدينة

# DistrictDefaultSelection
source: Choose District
ar_sa: اختر المنطقة

# EasyAccessBenefit
source: Unlike traditional hiring methods, MaidLinker puts control and clarity in your hands, helping you: ✅ Make informed decisions with full transparency. 💬 Communicate easily with referral sources and reception staff. 🧾 Track requests and statuses in real-time. 🚪 Reduce the hassle of walk-in .
ar_sa: على عكس طرق التوظيف التقليدية، تمنحك مؤسسة حيدر النهار التحكم والوضوح الكامل، حيث تساعدك على: ✅ اتخاذ قرارات مدروسة بكل شفافية. 💬 التواصل بسهولة مع مصادر الإحالة وموظفي الاستقبال. 🧾 متابعة الطلبات وحالة كل طلب في الوقت الفعلي. 🚪 تقليل الحاجة للزيارات الحضورية – .

# ElHAL
source: MaidLinker
ar_sa: مؤسسة حيدر النهار

# FewStepsToJoin
source: Few simple steps to register with MaidLinker platform, and join the MaidLinker team and refer and receive medical referrals in all dental specialties.
ar_sa: بضع خطوات بسيطة للتسجيل في منصة إحال، والانضمام إلى فريق وإحالة واستقبال الإحالات الطبية في جميع تخصصات طب الأسنان.

# HowJoinMaidLinker
source: How to Request a Maid through MaidLinker?
ar_sa: كيفية طلب خادمة من خلال مؤسسة حيدر النهار؟

# HowJoinMaidLinkerDesc
source: Requesting a maid with MaidLinker is quick, simple, and hassle-free. All you need to do is submit your name and mobile number, and one of our reception team members will personally contact you to help you choose the right maid based on your preferences. No complex forms or long procedures—just fill in your basic details and let us handle the rest!
ar_sa: طلب خادمة مع مؤسسة حيدر النهار سريع وبسيط وسهل. كل ما عليك فعله هو إدخال اسمك ورقم هاتفك الجوال، وسيتواصل معك أحد أعضاء فريق الاستقبال شخصيًا لمساعدتك في اختيار الخادمة المناسبة لك بناءً على تفضيلاتك. لا توجد نماذج معقدة أو إجراءات مطولة - ما عليك سوى ملء بياناتك الأساسية واترك الباقي علينا!

source: JOIN NOW
ar_sa: انضم الان

# JustFewInfo
source: Registration to MaidLinker few information about your personal data, contact numbers and academic qualifications. Also, you will need to attach the professional classification and registration card of the Commission for Health Specialties.
ar_sa: التسجيل يحتاج القليل من المعلومات حول بياناتك الشخصية وأرقام الاتصال والمؤهلات الأكاديمية. ستحتاج أيضًا إلى إرفاق التصنيف المهني وبطاقة التسجيل الخاصة بلجنة التخصصات الصحية.

# MultipleOptionsBenefit
source: Start Now: Choose a Maid Click below to browse available maids, compare options, and submit your request—it's quick, reliable, and made for your peace of mind.
ar_sa: ابدأ الآن: اختر خادمة انقر أدناه لتصفح الخادمات المتاحات، ومقارنة الخيارات، وإرسال طلبك - خدمة سريعة وموثوقة ومصممة لراحتك.

source: Our Vision
ar_sa: رؤيتنا

# OurVisionDesc
source: To improve the level of dental services, by providing and facilitating reaching the best doctors in various dental specialties, including specialists and consultants. Also, take advantage of the new graduated dentist to improve the dental profession.
ar_sa: الارتقاء بمستوى خدمات طب الأسنان ، من خلال توفير وتسهيل الوصول إلى أفضل العاملات في مختلف تخصصات طب الأسنان ، بما في ذلك المتخصصين والاستشاريين. أيضًا ، استفد من طبيب الأسنان المتخرج الجديد لتحسين مهنة طب الأسنان.

source: Read more
ar_sa: المزيد

# RegisterMaidLinkerNow
source: Register in MaidLinker Now
ar_sa: انضم الى إحال الان

source: SEARCH
ar_sa: بحث

# SearchByName
source: Or search by name
ar_sa: ابحث بالأسم

# ServiceDefaultSelection
source: Choose Service
ar_sa: اختر الخدمة

# SpecialityDefaultSelection
source: Choose Speciality
ar_sa: اختر التخصص

source: Why MaidLinker?
ar_sa: لماذا؟

# WhyMaidLinkerPlatform
source: Why Use A Referral Platform?
ar_sa: مؤسسة حيدر النهار؟

# WhyMaidLinkerPlatformDesc
source: MaidLinker is the trusted digital platform that simplifies the process of connecting families with qualified domestic workers. Whether you're searching for a maid or offering referral services, MaidLinker brings convenience, transparency, and trust into one place.
ar_sa: مؤسسة حيدر النهار هي المنصة الرقمية الموثوقة التي تُبسّط عملية ربط العائلات بعاملات المنازل المؤهّلات. سواء كنت تبحث عن خادمة أو تُقدّم خدمات إحالة، فإن MaidLinker تجمع بين الراحة والشفافية والثقة في مكان واحد.
