Repository: AnasJayyusi/MaidLinker
Catalog: MaidLinker/Resources/Views.Home.About.*.resx
Languages: ar_sa

source: About Us
ar_sa: معلومات عنا

# MaidLinkerParhPartOne
source: MaidLinker was born out of a real need to simplify the process of finding trustworthy and qualified domestic workers, after many experiences with the complexity of traditional recruitment methods. We aim to offer a smart, transparent platform that connects clients with recruitment agencies, providing a safe and seamless experience for requesting domestic workers.
ar_sa: جاءت فكرة مؤسسة حيدر النهار من الحاجة إلى تسهيل الوصول إلى العمالة المنزلية الموثوقة والمؤهلة، بعد تجارب متعددة مع تعقيدات طرق الاستقدام التقليدية. نسعى إلى تقديم منصة ذكية وشفافة تربط بين العملاء ومكاتب الاستقدام، وتوفر تجربة سهلة وآمنة لطلب العمالة المنزلية.

# MaidLinkerParhPartTwo
source: MaidLinker seeks to raise the quality of domestic worker recruitment services by empowering clients to make informed decisions based on clear information, while offering a variety of options to meet their needs. We are also committed to supporting a professional environment for recruitment offices, fostering trust and effective communication between all parties.
ar_sa: تهدف مؤسسة حيدر النهار إلى رفع جودة خدمات الاستقدام، وتمكين العملاء من اتخاذ قرارات مبنية على معلومات واضحة، مع تقديم خيارات متعددة تناسب احتياجاتهم. كما نحرص على دعم بيئة احترافية لمكاتب الاستقدام، وتعزيز الثقة والتواصل الفعّال بين جميع الأطراف.

# ElHAL
source: MaidLinker
ar_sa: مؤسسة حيدر النهار

# FirstPoint
source: Simple steps to request a housemaid through the platform.
ar_sa: سهولة طلب العمالة المنزلية من خلال خطوات بسيطة عبر المنصة.

source: Home
ar_sa: الصحفة الرئيسية

source: Mission
ar_sa: مهمتنا

source: OUR MISSION
ar_sa: مهمتنا

# OurMissionDesc
source: MaidLinker aims to make hiring domestic workers easier and more reliable by connecting clients with trusted maids through a simple request — just a name and phone number. Our reception team takes care of the rest.
ar_sa: تهدف MaidLinker إلى تسهيل عملية استقدام العاملات المنزليات من خلال ربط العملاء بعاملات موثوقات عبر طلب بسيط يحتوي على الاسم ورقم الجوال. ويتولى فريق الاستقبال المتابعة والاهتمام بكافة التفاصيل.

source: OUR VISION
ar_sa: رؤيتنا

# OurVisionDesc
source: To enhance the quality of domestic help services by making access to trusted and qualified maids easier, faster, and more transparent for every household.
ar_sa: رؤيتنا الارتقاء بجودة خدمات العاملات المنزليات من خلال تسهيل الوصول إلى عاملات موثوقات ومؤهلات بطريقة أسرع وأكثر شفافية لكل أسرة.

# PHILOSOPHY
source: Our values
ar_sa: قيمنا

# PHILOSOPHYDesc
source: To provide exceptional maid recruitment services with transparency, trust, and professionalism at every step.
ar_sa: تقديم رعاية أسنان متميزة مع الالتزام بالصدق والنزاهة والأمانة. جودة...

# SecPoint
source: Direct and fast communication with reception staff to clarify needs and follow up.
ar_sa: تواصل مباشر وسريع مع موظفي الاستقبال لتحديد المتطلبات والمتابعة.

# ThirdPoint
source: A variety of nationalities and experiences to help you choose the right maid
ar_sa: خيارات متعددة من الجنسيات والخبرات لمساعدتك في اختيار العاملة المناسبة.

# WhyMaidLinker
source: Why Choose MaidLinker ?
ar_sa: لماذا تختار مؤسسة حيدر النهار؟
